# Lab 1 Setting up the Weather database

We need to download the database first by using the following code in a *code block* and also upgrade the version of the SQL database (SQLite).
We can run the code by pressing the "â–¶" play button.
This needs to be run once at the begining of the session.

In [ ]:
!wget https://essexuniversity.box.com/shared/static/c3vee0c2iclzc9wouhblr9jp5v7lix0o.db -O weather.db &> /dev/null

In order to issue SQL commands we will use the SQLite capabilities of Google Colab by loading the SQL extension with the `%load_ext sql` statement.

In [ ]:
# now we can use the magic extension to connect to our SQLite DB
# use %sql to write an inline SQL command
%load_ext sql

# use %%sql to write SQL commands in a cell
# Loads the downloaded database (weather data) inthis case
%sql sqlite:///weather.db

# Shows the sqlite version
%sql SELECT sqlite_version();

 * sqlite:///weather.db
Done.

[('3.37.2',)]

Then we can run SQL queries by using:
- the `%sql` expression for a single line query
- the `%%sql` expression for a multiple line query

## Display all tables
As an example we cal display all the tabled loadded in the database by using the
following statement:

In [ ]:
# Display all the table names
# omiting the ones starting with "sqlite_" (internal not to be used directly)
%%sql
SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';

 * sqlite:///weather.db
Done.

[('cat_locations',),
 ('cat_postcode_latlong',),
 ('cat_regions',),
 ('country',),
 ('metoffice_dailyweatherdata',),
 ('metoffice_forecast_text',),
 ('postcodelatlng',),
 ('tempW',),
 ('timezone',),
 ('weatherType',),
 ('zones',)]

# Exercise PART I
MySQL can open multiple databases so we need to specify the name of the database (e.g. `DATABASE_NAME.TABLE_NAME`).
But `SQLite` (the SQL database that we use in this notebook) opens only one database at a time and we don't use the name of the database. As an example the table `cat_regions` is:
- **MySQL**: `weather_db.cat_regions`
- **SQLite**: `cat_regions`

## Exercise 1
Using the CREATE TABLE statement, create a table called client_data with the
following schema:

Field       | Data Type  | Constaint
------------|------------|-------------------
ID          | integer    | Primary key
First_name  | varchar 40 | NOT NULL
Last_name   | varchar 40 | None
Nationality | varchar 40 | None
Age         | float      | greather than 18

In [ ]:
%%sql
CREATE TABLE client_data (
ID int PRIMARY KEY,
first_name varchar(40) NOT NULL,
last_name varchar(40) NOT NULL,
nationality varchar(40),
Age decimal(6) CHECK( Age>18)
);

 * sqlite:///weather.db
Done.

[]

## Exercise 2
Insert the following records in the data base using the INSERT statement:

ID	| first_name	| last_name	| nationality	| Age
----|-------------|-----------|-------------|------
1	  | John	      | S	        | British	    |None
2	  | Peter	      |Jackson    |	None	      |20
3	  | Tom         |	W         |	None        |20
4	  | Jack	      |Patrick	  | American    |30

In [ ]:
%%sql
INSERT INTO client_data VALUES
(1, 'John', 'S', 'British', NULL),
(2, 'Peter', 'Jackson', NULL, 20),
(3, 'Tom', 'W', NULL, 20),
(4, 'Jack', 'Patrick', 'American', 30);
SELECT * FROM client_data;  /* Display the table*/

 * sqlite:///weather.db
4 rows affected.
Done.

[(1, 'John', 'S', 'British', None),
 (2, 'Peter', 'Jackson', None, 20),
 (3, 'Tom', 'W', None, 20),
 (4, 'Jack', 'Patrick', 'American', 30)]

## Exercise 3
Add a column called "type" to the Client_data table and fill the records of this column with the value '1' for the records where nationality is known, and '2' otherwise.

In [ ]:
%%sql
ALTER TABLE client_data ADD Type VARCHAR(40);
UPDATE client_data SET Type = 1 WHERE nationality IS NOT NULL;
UPDATE client_data SET Type = 2 WHERE nationality IS NULL;

## Exercise 4
Delete the records of the table client_data where the last name is unknown.
Although we donâ€™t have any fields with this constraint, we can still use:

In [ ]:
%%sql
DELETE FROM client_data where last_name IS NULL;

## Exercise 5
Delete all the content from the column â€˜Ageâ€™ **without** deleting the column from the schema.

In [ ]:
%%sql
UPDATE client_data SET AGE = NULL;

## Exercise 6
Delete table client_data including the schema.

In [ ]:
%%sql
DROP TABLE client_data;

# PART 2

## Exercise 1
There are many records in the table `cat_locations` where the country column is null. Fill these records with the value `"UK"`.

In [ ]:
%%sql
-- Display the first 5 records where the Country is NULL
SELECT * from cat_locations WHERE Country IS NULL LIMIT 5;

 * sqlite:///weather.db
Done.

[(3, 'Southampton Airport', None, None, 'se', 'South East', 50.9503, -1.3567, 'Europe', 11.0, '', 'Hampshire'),
 (5, 'London City Airport', None, None, 'se', 'South East', 51.5048, 0.058, 'Europe', 5.0, '', 'Greater London'),
 (6, 'Lydd', None, None, 'se', 'South East', 50.9561, 0.9392, 'Europe', 4.0, '', 'Kent'),
 (7, 'Cranfield', None, None, 'ee', 'East of England', 52.0703, -0.6267, 'Europe', 109.0, '', 'Central Bedfordshire'),
 (8, 'Belfast Harbour', None, None, 'ni', 'Northern Ireland', 54.613, -5.877, 'Europe', 5.0, '', 'County Antrim')]

In [ ]:
%%sql
-- Change them
UPDATE cat_locations SET Country = 'UK' where Country IS NULL;

 * sqlite:///weather.db
Done.

[]

In [ ]:
%%sql
--display again
SELECT * from cat_locations WHERE Country IS NULL;

 * sqlite:///weather.db
Done.

[]

## Exercise 2
Delete the rows from table `tempW` where rainfall is `null`

In [ ]:
%%sql
-- SELECT * FROM tempW WHERE rainfall IS NULL LIMIT 5;
DELETE FROM tempW WHERE rainfall IS NULL;

 * sqlite:///weather.db
Done.

[]

## Exercise 3
From this table also delete the `timestamp` column from the schema.

In [ ]:
%%sql
ALTER TABLE tempW DROP timestamp;

 * sqlite:///weather.db
Done.

[]

In [ ]:
%%sql
-- print the first 3 lines to check the variables
SELECT * FROM tempW LIMIT 3;

 * sqlite:///weather.db
Done.

[(3672, '2015-02-20 00:00:00', '2015-02-20', '00:00:00', 6.8, 6, 94.1, 0.0, 0, 0, 0, '220', '\\N', '0.6', 0.0),
 (3672, '2015-02-20 01:00:00', '2015-02-20', '01:00:00', 6.7, 7, 95.5, 0.0, 0, 0, 0, '220', '\\N', '0.2', 0.0),
 (3672, '2015-02-20 02:00:00', '2015-02-20', '02:00:00', 6.5, 5, 95.5, 0.0, 0, 0, 0, '230', '\\N', '0.2', 0.0)]